fix: cmd/peer too complex --> move to internal/
fix: lab cluster testing error
